espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_mbedtls_support/src/crypto_aes.c
  return 0;
}

/*
 * AES-ECB block encryption
 */
int mbedtls_internal_aes_encrypt(mbedtls_aes_context *ctx,
                                 const unsigned char input[16],
                                 unsigned char output[16])
{
  return mbedtls_aes_crypt_ecb(ctx, MBEDTLS_AES_ENCRYPT, input, output);
}

/*
 * AES-ECB block decryption
 */
int mbedtls_internal_aes_decrypt(mbedtls_aes_context *ctx,
                                 const unsigned char input[16],
                                 unsigned char output[16])
{
  return mbedtls_aes_crypt_ecb(ctx, MBEDTLS_AES_DECRYPT, input, output);
}

/*
 * AES-ECB block encryption/decryption
 */
int mbedtls_aes_crypt_ecb(mbedtls_aes_context *ctx,
                          int mode,
                          const unsigned char input[16],
                          unsigned char output[16])
{
  int ret = 0;
  CORE_DECLARE_IRQ_STATE;

  AES_VALIDATE_RET(ctx != NULL);
  AES_VALIDATE_RET(input != NULL);
  AES_VALIDATE_RET(output != NULL);
  AES_VALIDATE_RET(mode == MBEDTLS_AES_ENCRYPT
                   || mode == MBEDTLS_AES_DECRYPT);

  if ( ctx->keybits != 128UL && ctx->keybits != 256UL) {
    return MBEDTLS_ERR_PLATFORM_FEATURE_UNSUPPORTED;
  }

  CRYPTO_TypeDef *device = crypto_management_acquire();
  device->WAC = 0;
  device->CTRL = 0;

  CORE_ENTER_CRITICAL();
  CRYPTO_KeyBufWriteUnaligned(device,
                              ctx->key,
                              (ctx->keybits == 128UL) ? cryptoKey128Bits
                              : cryptoKey256Bits);
  CRYPTO_DataWriteUnaligned(&device->DATA0, (uint8_t *)input);
  CORE_EXIT_CRITICAL();

  if ( mode == MBEDTLS_AES_ENCRYPT ) {
    device->CMD = CRYPTO_CMD_INSTR_AESENC;
  } else {
    device->CMD = CRYPTO_CMD_INSTR_AESDEC;
  }
  while ((device->STATUS & CRYPTO_STATUS_INSTRRUNNING) != 0UL) {
    /* wait while busy */
  }

  CORE_ENTER_CRITICAL();
  CRYPTO_DataReadUnaligned(&device->DATA0, (uint8_t *)output);
  CORE_EXIT_CRITICAL();

  crypto_management_release(device);

  return ret;
}

#if defined(MBEDTLS_CIPHER_MODE_CBC)

/*
 * AES-CBC buffer encryption/decryption
 */
int mbedtls_aes_crypt_cbc(mbedtls_aes_context *ctx,
                          int mode,
                          size_t length,
                          unsigned char iv[16],
                          const unsigned char *input,
                          unsigned char *output)
{
  int ret = 0;
  CORE_DECLARE_IRQ_STATE;
  size_t processed = 0;

  AES_VALIDATE_RET(ctx != NULL);
  AES_VALIDATE_RET(mode == MBEDTLS_AES_ENCRYPT
                   || mode == MBEDTLS_AES_DECRYPT);
  AES_VALIDATE_RET(iv != NULL);
  AES_VALIDATE_RET(input != NULL);
  AES_VALIDATE_RET(output != NULL);

  /* Input length must be a multiple of 16 bytes which is the AES block
     length. */
  if ( length & 0xf ) {
    return(MBEDTLS_ERR_AES_INVALID_INPUT_LENGTH);
  }

  if ( ctx->keybits != 128UL && ctx->keybits != 256UL) {
    return MBEDTLS_ERR_AES_BAD_INPUT_DATA;
  }

  CRYPTO_TypeDef *device = crypto_management_acquire();
  device->WAC = 0;
  device->CTRL = 0;

  CORE_ENTER_CRITICAL();
  CRYPTO_KeyBufWriteUnaligned(device,
                              ctx->key,
                              (ctx->keybits == 128UL) ? cryptoKey128Bits
                              : cryptoKey256Bits);
  if ( mode == MBEDTLS_AES_ENCRYPT ) {
    CRYPTO_DataWriteUnaligned(&device->DATA0, (uint8_t *)iv);
  } else {
    CRYPTO_DataWriteUnaligned(&device->DATA2, (uint8_t *)iv);
  }
  CORE_EXIT_CRITICAL();

  while ( processed < length ) {
    if ( mode == MBEDTLS_AES_ENCRYPT ) {
      CORE_ENTER_CRITICAL();
      CRYPTO_DataWriteUnaligned(&device->DATA0XOR, (uint8_t *)(&input[processed]));
      device->CMD = CRYPTO_CMD_INSTR_AESENC;
      CRYPTO_DataReadUnaligned(&device->DATA0, &output[processed]);
      CORE_EXIT_CRITICAL();
    } else {
      /* Decrypt input block, XOR IV to decrypted text, set ciphertext as next IV */
      CORE_ENTER_CRITICAL();
      CRYPTO_DataWriteUnaligned(&device->DATA0, (uint8_t *)(&input[processed]));
      CRYPTO_EXECUTE_4(device,
                       CRYPTO_CMD_INSTR_DATA0TODATA1,
                       CRYPTO_CMD_INSTR_AESDEC,
                       CRYPTO_CMD_INSTR_DATA2TODATA0XOR,
                       CRYPTO_CMD_INSTR_DATA1TODATA2);
      CRYPTO_DataReadUnaligned(&device->DATA0, &output[processed]);
      CORE_EXIT_CRITICAL();
    }
    processed += 16;
  }

  if ( processed >= 16 ) {
    if ( mode == MBEDTLS_AES_ENCRYPT ) {
      memcpy(iv, &output[processed - 16], 16);
    } else {
      CORE_ENTER_CRITICAL();
      CRYPTO_DataReadUnaligned(&device->DATA2, iv);
      CORE_EXIT_CRITICAL();
    }
  }

  crypto_management_release(device);

  return ret;
}
#endif /* MBEDTLS_CIPHER_MODE_CBC */

#if defined(MBEDTLS_CIPHER_MODE_CFB)
/*
 * AES-CFB128 buffer encryption/decryption
 */
int mbedtls_aes_crypt_cfb128(mbedtls_aes_context *ctx,
                             int mode,
                             size_t length,
                             size_t *iv_off,
                             unsigned char iv[16],
                             const unsigned char *input,
                             unsigned char *output)
{
  size_t n = iv_off ? *iv_off : 0;
  size_t processed = 0;
  int ret = 0;
  CORE_DECLARE_IRQ_STATE;

  AES_VALIDATE_RET(ctx != NULL);
  AES_VALIDATE_RET(mode == MBEDTLS_AES_ENCRYPT
                   || mode == MBEDTLS_AES_DECRYPT);
  AES_VALIDATE_RET(iv_off != NULL);
  AES_VALIDATE_RET(iv != NULL);
  AES_VALIDATE_RET(input != NULL);
  AES_VALIDATE_RET(output != NULL);

  if ( n > 15 ) {
    return MBEDTLS_ERR_AES_BAD_INPUT_DATA;
  }

  if (ctx->keybits != 128UL && ctx->keybits != 256UL) {
    return MBEDTLS_ERR_AES_BAD_INPUT_DATA;
  }

  while ( processed < length ) {
    if ( n > 0 ) {
      /* start by filling up the IV */
      if ( mode == MBEDTLS_AES_ENCRYPT ) {
        iv[n] = output[processed] = (unsigned char)(iv[n] ^ input[processed]);
      } else {
        int c = input[processed];
        output[processed] = (unsigned char)(c ^ iv[n]);
        iv[n] = (unsigned char) c;
      }
      n = (n + 1) & 0x0F;
      processed++;
      continue;
    } else {
      /* process one ore more blocks of data */
      CRYPTO_TypeDef *device = crypto_management_acquire();
      device->WAC = 0;
      device->CTRL = 0;

      CORE_ENTER_CRITICAL();
      CRYPTO_KeyBufWriteUnaligned(device,
                                  ctx->key,
                                  (ctx->keybits == 128UL)
                                  ? cryptoKey128Bits
                                  : cryptoKey256Bits);
      CRYPTO_DataWriteUnaligned(&device->DATA0, (uint8_t *)iv);
      CORE_EXIT_CRITICAL();

      /* Encryption: encrypt IV, encIV xor input -> output and IV */
      /* Decryption: encrypt IV, encIV xor input -> output, input -> IV */
      size_t iterations = (length - processed) / 16;
      for (size_t i = 0; i < iterations; i++ ) {
        device->CMD = CRYPTO_CMD_INSTR_AESENC;
        while ((device->STATUS & CRYPTO_STATUS_INSTRRUNNING) != 0) ;

        CORE_ENTER_CRITICAL();
        if ( mode == MBEDTLS_AES_ENCRYPT ) {
          CRYPTO_DataWriteUnaligned(&device->DATA0XOR,
                                    (uint8_t *)(&input[processed]));
          CRYPTO_DataReadUnaligned(&device->DATA0, &output[processed]);
        } else {
          CRYPTO_DataWriteUnaligned(&device->DATA1,
                                    (uint8_t *)(&input[processed]));
          device->CMD = CRYPTO_CMD_INSTR_DATA1TODATA0XOR;
          CRYPTO_DataReadUnaligned(&device->DATA0, &output[processed]);
          device->CMD = CRYPTO_CMD_INSTR_DATA1TODATA0;
        }
        CORE_EXIT_CRITICAL();
        processed += 16;
      }

      CORE_ENTER_CRITICAL();
      CRYPTO_DataReadUnaligned(&device->DATA0, iv);
      CORE_EXIT_CRITICAL();

      while ( length - processed > 0 ) {
        if ( n == 0 ) {
          device->CMD = CRYPTO_CMD_INSTR_AESENC;
          while ((device->STATUS & CRYPTO_STATUS_INSTRRUNNING) != 0) ;
          CORE_ENTER_CRITICAL();
          CRYPTO_DataReadUnaligned(&device->DATA0, iv);
          CORE_EXIT_CRITICAL();
        }
        /* Save remainder to iv */
        if ( mode == MBEDTLS_AES_ENCRYPT ) {
          output[processed] = (unsigned char)(iv[n] ^ input[processed]);
          iv[n] = output[processed];
        } else {
          int c = input[processed];
          output[processed] = (unsigned char)(c ^ iv[n]);
          iv[n] = (unsigned char) c;
        }
        n = (n + 1) & 0x0F;
        processed++;
      }

      crypto_management_release(device);
    }
  }

  if ( iv_off ) {
    *iv_off = n;
  }

  return ret;
}

